Repository: CherokeeLanguage/Action-Imitation-and-Fun-Series
Catalog: 06-Red-Riding-Hood/CAT/red-riding-hood-seven-kids/tm/corpus-nt-bbe.en.utf8.tmx
Source language: en
Languages: chr

source: If he has done you any wrong or is in debt to you for anything, put it to my account.
chr: ᎢᏳᏃ ᎤᏣᏘᏂ ᏂᏣᏛᏁᎴᏍᏗ, ᎠᎴ ᎯᏚᎨᏍᏕ, ᎠᏴᏉ ᎠᏆᎫᏴᏗ ᏅᏁᎸᎭ;

source: I, Paul, writing this myself, say, I will make payment to you: and I do not say to you that you are in debt to me even for your life.
chr: ᎠᏴ ᏉᎳ ᎠᏋᏒ ᎠᏉᏰᏃ ᎬᏓ ᎪᏪᎸᎦ, ᎠᏴ ᏓᎦᎫᏴᎯ; ᎥᏝᏍᎩᏂᏃᏅ ᏨᏒ ᎨᏒ ᎾᏍᏉ ᎬᏚᎦ ᏗᏍᏆᏓᏲᎯᏎᏗᏱ ᏱᎬᏲᏎᎭ.

source: So brother, let me have joy of you in the Lord: give new life to my heart in Christ.
chr: ᎥᎥ, ᏗᎾᏓᏅᏟ, ᎤᎵᎮᏍᏗ ᏍᏆᏓᏅᏓᏗᏍᏓ ᎤᎬᏫᏳᎯ ᎢᏳᏩᏂᏌᏛ; ᎯᎦᎵᏍᏓᏓᏉ ᎠᎩᎾᏫ ᎤᎬᏫᏳᎯ ᏕᎾᏁᎶᏛᎢ.

source: Being certain that you will do my desire, I am writing to you, in the knowledge that you will do even more than I say.
chr: ᏦᎯᏳᏒ ᎠᏆᎵᏍᎦᏍᏙᏛ ᏫᎬᏲᏪᎳᏁᎸᎩ, ᏥᎦᏔᎲᎩ ᎾᏍᏉ ᏣᎶᏒᏍᏙᏗᏱ ᎨᏒ ᎿᏛᏁᎲ ᏄᏍᏛ ᎬᏁᏤᎲᎢ.

source: And make a room ready for me; for I am hoping that through your prayers I will be given to you.
chr: ᎠᎴ ᎾᏍᏉ ᏍᏆᏛᏅᎢᏍᏓᏁᎸᎭ ᏍᎩᏍᏆᏂᎪᏙᏗᏱ; ᎤᏚᎩᏰᏃ ᎠᏋᎭ ᎢᏣᏓᏙᎵᏍᏗᏍᎬ ᎢᏳᏩᏂᏐᏗᏱ ᏔᎵᏁ ᏫᏨᎷᏤᏗᏱ.

source: Epaphras, my brother-prisoner in Christ Jesus, sends you his love;
chr: ᏫᎨᏣᏲᎵᎦ ᎡᎦᏉ, ᏗᏧᎳᎭ ᎣᏍᏗᏴᎩ ᎦᎶᏁᏛ ᏥᏌ ᎣᎩᏂᏍᏛᏗᏍᎬᎢ;

source: And so do Mark, Aristarchus, Demas, and Luke, my brother-workers.
chr: ᎹᎦ, ᎡᎵᏍᏓᎦ, ᏗᎹ, ᎷᎦ, ᎢᏧᎳᎭ ᏦᎩᎸᏫᏍᏓᏁᎯ

source: The grace of our Lord Jesus Christ be with your spirit. So be it.
chr: ᎬᏩᎦᏘᏯ ᎤᏓᏙᎵᏍᏗ ᎨᏒ ᎢᎦᏤᎵ ᎤᎬᏫᏳᎯ ᏥᏌ ᎦᎶᏁᏏ ᏔᎵ ᎤᏛᏕᎨᏍᏗ ᏕᏣᏓᏅᏛᎢ. ᎡᎺᏅ

source: Epistle to the Hebrews
chr: ᏉᎳ ᎠᏂᏈᎷ ᏧᏬᏪᎳᏁᎸᎯ

source: In times past the word of God came to our fathers through the prophets, in different parts and in different ways;
chr: ᎤᏁᎳᏅᎯ, ᎾᏍᎩ ᎢᎸᎯᏳ ᏥᎨᏒ, ᎢᏴᏛᎭᏉ ᎠᎴ ᏧᏓᎴᏅᏛ ᎬᏔᏅᎯ ᏥᏕᎧᏁᏤᎮ ᏗᎩᎦᏴᎵᎨ ᎠᎾᏙᎴᎰᏍᎩ ᏕᎬᏗᏍᎬᎢ,

source: But now, at the end of these days, it has come to us through his Son, to whom he has given all things for a heritage, and through whom he made the order of the generations;
chr: ᎪᎯ ᎤᎵᏍᏆᎸᏗ ᏕᎨᏌᏗᏒ ᎢᎩᏁᏤᎸ ᎤᏪᏥ ᎤᏮᏔᏅ, ᎾᏍᎩ ᎤᏪᎧᏅ ᎤᏤᎵ ᎢᏳᎵᏍᏙᏗᏱ ᏂᎦᏗᏳ ᏧᏓᎴᏅᏛ, ᎾᏍᎩ ᎾᏍᏉ ᎬᏗᏍᎬ ᎡᎶᎯ ᏚᏬᏢᏁᎢ;

source: Who, being the outshining of his glory, the true image of his substance, supporting all things by the word of his power, having given himself as an offering making clean from sins, took his seat at the right hand of God in heaven;
chr: ᎾᏍᎩ ᏗᎦᎸᏌᏓᏗᏍᎩ ᏥᎨᏒᎩ ᎤᏤᎵ ᎦᎸᏉᏗᏳ ᎨᏒᎢ, ᎠᎴ ᎾᏍᎩᏯ ᏗᏟᎶᏍᏔᏅᎯ ᏥᎨᏒᎩ ᎾᏍᎩ ᏄᏍᏛᎢ, ᎠᎴ ᏂᎦᏗᏳ ᏧᏓᎴᏅᏛ ᏥᏚᏍᏆᏂᎪᏗᏕᎬᎩ ᏥᎬᏗᏍᎬᎩ ᎤᎵᏂᎩᏗᏳ ᎧᏁᎬᎢ, ᎾᎯᏳ ᎤᏩᏒ ᎤᏓᏛᏔᏅ ᎤᏅᎦᎸᎭ ᎢᎩᏍᎦᏅᏨᎢ, ᎤᏪᏁᎢ ᎠᎦᏘᏏᏗᏢ ᎦᎸᏉᏗᏳ ᎨᏒ ᎦᎸᎳᏗ.

source: Having become by so much better than the angels, as the name which is his heritage is more noble than theirs.
chr: ᎾᏍᎩ ᎢᎦᎢ ᎤᏟ ᎢᏳᏓᎵᏁᎯᏯᏛ ᎾᎬᏁᎴ ᎡᏍᎦ ᏗᏂᎧᎿᏩᏗᏙᎯ, ᎾᏍᎩ ᎤᏘᏯᏍᏓᏁᏗ ᎨᏒ ᎤᏟ ᎢᎦᎸᏉᏗ ᏧᏙᏍᏙᏗ ᏧᏩᏛᏔᏅ.

source: To which of the angels did God say at any time, You are my Son, this day I have given you being? or, I will be his Father, and he will be my Son?
chr: ᏗᏂᎧᎿᏩᏙᎯᏰᏃ ᎨᏒ ᎦᎪ ᎢᎸᎯᏳ ᎯᎠ ᏄᏪᏎᎶᎢ, ᎠᏇᏥ ᏂᎯ ᎪᎯ ᎢᎦ ᏍᏆᏕᎲᏏ? ᎠᎴ ᎾᏍᏉ ᎯᎠ; ᎠᏴ ᏥᎦᏴᎵᎨ ᎨᏎᏍᏗ, ᎾᏍᎩᏃ Ꮎ ᎠᏯᏥ ᎨᏎᏍᏗ?

source: And again, when he is sending his only Son into the world, he says, Let all the angels of God give him worship.
chr: ᎠᎴ ᎾᏍᏉ, ᎾᎯᏳ ᎢᎬᏱ ᎤᏕᏁᎸᎯ ᎡᎶᎯ ᎤᎾᏄᎪᏫᏒ ᎯᎠ ᏄᏪᏎᎢ; ᎠᎴ ᎾᏂᎥ ᏗᏂᎧᎿᏩᏗᏙᎯ ᎤᏁᎳᏅᎯ ᏧᏤᎵ ᏫᎬᏩᏓᏙᎵᏍᏓᏏ.

source: And of the angels he says, Who makes his angels winds, and his servants flames of fire:
chr: ᏗᏂᎧᎿᏩᏗᏙᎯᏃ ᎯᎠ ᏂᏕᎦᏪᏎᎭ, ᎾᏍᎩ ᏗᏂᎧᎿᏩᏗᏙᎯ ᏧᏤᎵ ᎤᏃᎴ ᏥᏂᏕᎬᏁᎭ, ᎠᎴ ᎠᏥᎸ ᎠᏓᏪᎳᎩᏍᎩ ᏧᏅᏏᏓᏍᏗ ᏥᏂᎬᏁᎭ.

source: But of the Son he says, Your seat of power, O God, is for ever and ever; and the rod of your kingdom is a rod of righteousness.
chr: ᎤᏪᏥᏍᎩᏂ ᎯᎠ ᏂᎦᏪᏎᎭ, ᏣᏤᎵ ᎦᏍᎩᎸ, ᏣᏁᎳᏅᎯ, ᏂᎪᎯᎸ ᎠᎴ ᏂᎪᎯᎸ ᏂᎬᏩᏍᏗᏉ; ᎠᏙᎳᏅᏍᏗ ᏚᏳᎪᏛ ᎠᏛᏁᏙᏗ ᎾᏍᎩ ᎠᏙᎳᏅᏍᏗ ᎪᎱᏍᏗ ᏨᏗᎭ ᎾᎿ ᏣᎬᏫᏳᎯ ᎨᏒᎢ.

source: You have been a lover of righteousness and a hater of evil; and so God, your God, has put the oil of joy on your head more than on the heads of those who are with you.
chr: ᎣᏏᏳ ᏣᏰᎸᏅ ᏚᏳᎪᏛ ᎨᏒᎢ; ᎠᎴ ᏣᏂᏆᏘᎸ ᎤᏲ ᎨᏒᎢ, ᎾᏍᎩ ᎢᏳᏍᏗ ᎤᏁᎳᏅᎯ, ᎾᏍᎩ ᏂᎯ ᏣᏁᎳᏅᎯ ᎤᏟ ᎢᎦᎢ ᏣᎶᏁᏔᏅ ᎠᏠᏁᏗ ᎣᏍᏛ ᎠᏓᏓᏅᏓᏗᏍᏗᏍᎩ, ᎡᏍᎦᏉ ᎾᏍᎩ Ꮎ ᎢᏣᎵᎪᎯ.

source: You, Lord, at the first did put the earth on its base, and the heavens are the works of your hands:
chr: ᎠᎴ, ᎾᏍᏉ [ᎯᎠ ᏂᎦᏪᎭ] ᏂᎯ, ᏣᎬᏫᏳᎯ, ᏗᏓᎴᏂᏍᎬ ᎡᎶᎯ ᎦᎫᏍᏓᎥ ᏣᏁᎢ; ᎠᎴ ᎦᎸᎶᎢ ᏗᏦᏰᏂ ᏦᏢᏔᏁᎢ;

source: They will come to their end; but you are for ever; they will become old as a robe;
chr: ᏛᎾᎵᏛᏔᏂ ᎾᏍᎩ; ᏂᎯᏍᎩᏂ ᏁᏣᏛᏁᏍᏗᏉ; ᎠᎴ ᎾᏍᎩ ᏂᎦᏛ ᏓᏳᏁᏔᏥ ᎠᏄᏬ ᎾᏍᎩᏯᎢ;

source: They will be rolled up like a cloth, even like a robe, and they will be changed: but you are the same and your years will have no end.
chr: ᎠᎴ ᎤᏔᏃᎯ ᎠᏄᏬ ᎾᏍᎩᏯ ᏙᏘᏇᏅᎯ, ᎠᎴ ᏗᎦᏁᏟᏴᏛ ᎨᏎᏍᏗ; ᏂᎯᏍᎩᏂ ᏁᏣᏍᏗᏉ, ᎠᎴ ᏕᏣᏕᏘᏱᎶᏍᎬ ᎥᏝ ᏭᏍᏘᏥᎯᏍᏗ ᏱᎩ.

source: But of which of the angels has he said at any time, Take your seat at my right hand till I put all those who are against you under your feet?
chr: ᎦᏙᎨ ᎤᏍᏗ ᏗᏂᎧᎿᏩᏗᏙᎯ ᎨᏒ ᎯᎠ ᏄᏪᏎᎶᎢ, ᏥᎦᏘᏏᏗᏢ ᏦᎴᏍᏗ ᎬᏂ ᎨᏤᏍᎦᎩ ᎦᏍᎩᎶ ᏗᏣᎳᏏᏗᏱ ᏂᎦᏥᏴᏁᎸᎭ?

source: Are they not all helping spirits, who are sent out as servants to those whose heritage will be salvation?
chr: ᏝᏍᎪ ᎾᏍᎩ Ꮎ ᏂᎦᏛ ᏗᏓᏅᏙ ᎨᏥᏅᏏᏓᏍᏗ ᏱᎩ, ᎨᏥᏅᏏᏛ ᏧᏂᏍᏕᎸᎯᏓᏍᏗᏱ ᎾᏍᎩ Ꮎ ᎠᎵᏍᏕᎸᏙᏗ ᎨᏒ ᎤᎾᏤᎵ ᎢᏳᎵᏍᏙᏗ ᏥᎩ?

source: For this reason there is the more need for us to give attention to the things which have come to our ears, for fear that by chance we might be slipping away.
chr: ᎾᏍᎩ ᎢᏳᏍᏗ ᎤᏟ ᎢᎦᎢ ᎢᎦᎦᏌᏯᏍᏙᏗ ᏱᏂᎦᎵᏍᏓ ᏄᏍᏛ ᎢᎦᏛᎦᏅᎢ, ᎾᏍᎩ ᎢᎸᎯᏳ ᏗᎬᏍᎦᎶᎢᏍᏗᏱ ᏂᎨᏒᎾ ᎢᏳᎵᏍᏙᏗᏱ.

source: Because if the word which came through the angels was fixed, and in the past every evil act against God's orders was given its full punishment;
chr: ᎢᏳᏰᏃ ᎧᏃᎮᏛ ᏗᏂᎧᎿᏩᏗᏙᎯ ᎬᏂᎨᏒ ᎢᏳᏅᏁᎸᎯ ᎨᏒ ᎤᎵᏂᎩᏗᏳ ᏱᎩ, ᎠᎴ ᏄᏓᎴᏒ ᎠᏍᎦᏅᏨᎯ ᎨᏒ ᎠᎴ ᏄᏃᎯᏳᏒᎾ ᎨᏒ ᏚᏳᎪᏛ ᎨᏥᏍᏛᏗᏔᏅᎯ ᏱᎩ;

source: What will come on us, if we do not give our minds to such a great salvation? a salvation of which our fathers first had knowledge through the words of the Lord, and which was made certain to us by those to whom his words came;
chr: ᎦᏙ ᏱᎦᎵᏍᏙᏓ ᏱᏓᏚᏓᎳᎩ, ᎢᏳᏃ ᏂᎦᎦᏌᏯᏍᏔᏅᎾ ᏱᎩ ᎾᏍᎩ ᎢᎦᎸᏉᏗ ᎠᎵᏍᏕᎸᏙᏗ; ᎾᏍᎩ ᎢᎬᏱ ᏧᎴᏅᎲ ᏧᏃᎮᎴ ᎤᎬᏫᏳᎯ, ᎠᎴ ᎾᏍᎩ ᎠᏴ ᏥᎨᎩᏍᏓᏱᏕᎸᎩ ᎾᏍᎩ Ꮎ ᎬᏩᏛᎦᏁᎸᎯ;

source: And God was a witness with them, by signs and wonders, and by more than natural powers, and by his distribution of the Holy Spirit at his pleasure.
chr: ᎤᏁᎳᏅᎯ ᎾᏍᏉ ᏕᎪᎯᏳᏓᏁᎲᎩ, ᏕᎬᏗᏍᎬᎩ ᎤᏰᎸᏛ ᎠᎴ ᎤᏍᏆᏂᎪᏗ, ᎠᎴ ᎤᏍᏆᏂᎪᏗ ᏗᎦᎸᏫᏍᏓᏁᏗ ᎨᏒᎢ, ᎠᎴ ᎦᎸᏉᏗᏳ ᎠᏓᏅᏙ ᎤᏓᏁᏗ ᎨᏒ ᎾᏍᎩᏯ ᎤᏩᏒ ᎣᏏᏳ ᎤᏰᎸᏗ ᎨᏒᎢ.

source: For he did not make the angels rulers over the world to come, of which I am writing.
chr: ᏗᏂᎧᎿᏩᏗᏙᎯᏰᏃ ᎥᏝ ᏄᏂᎬᏫᏳᏌᏕᎩ ᏱᏂᏚᏩᏁᎸ ᎾᏍᎩ ᎾᎿ ᎡᎶᎯ ᎤᎵᏰᎢᎶᎯᏍᏗ ᏥᎨᏒᎩ, ᎾᏍᎩ ᏥᏗᏁᎢᏍᏗᎭ.

source: But a certain writer has given his witness, saying, What is man, that you keep him in mind? what is the son of man, that you take him into account?
chr: ᎠᏏᏴᏫᏍᎩᏂ ᎢᎸᎯᏢ ᎤᏁᏤ, ᎯᎠ ᏄᏪᏎᎢ, ᎦᏙ ᏴᏫ ᎾᏍᎩ ᏥᏯᏓᏅᏖᏍᎪᎢ? ᎠᎴ ᏴᏫ ᎤᏪᏥ, ᎾᏍᎩ ᏥᏯᎦᏔᏂᎯᎰᎢ?

source: You made him a little lower than the angels; you gave him a crown of glory and honour, and made him ruler over all the works of your hands:
chr: ᎤᏍᏗᎩᏛᏉᏰᏃ ᎡᏍᎦ ᏂᏴᏁᎸ ᏂᎩᏴᏁᎸ ᏗᏂᎧᎿᏩᏗᏙᎯ; ᏗᎬᏩᎸᏌᏓ ᎠᎴ ᎦᎸᏉᏗᏳ ᎨᏒ ᎯᏍᏚᎶᏔᏅ, ᎠᎴ ᎤᎬᏫᏳᏌᏕᎩ ᏂᏴᏁᎸ ᎪᎱᏍᏗ ᏦᏢᏅᏅᎯ ᎨᏒᎢ.

source: You put all things under his feet. For in making man the ruler over all things, God did not put anything outside his authority; though we do not see everything under him now.
chr: ᏄᏓᎴᏒ ᎪᎱᏍᏗ ᏧᎳᏏᏕᏂ ᎭᏫᏂᏗᏢ ᏂᏕᏨᏁᎸ. ᎾᏍᎩᏰᏃ ᏂᎦᏛ ᎭᏫᏂᏗᏢ ᏥᏄᏩᏁᎴᎢ, ᎥᏝ ᎪᎱᏍᏗ ᏳᏃᎯᏰ ᎾᏍᎩ ᎭᏫᏂᏗᏢ ᏄᏩᏁᎸᎾ ᎨᏒᎢ. ᎠᏎᏃ ᎪᎯ ᎨᏒ ᎥᏝ ᏱᏗᎪᏩᏘᎭ ᏂᎦᏛ ᎭᏫᏂᏗᏢ ᏱᎾᎬᏁᎸ.

source: But we see him who was made a little lower than the angels, even Jesus, crowned with glory and honour, because he let himself be put to death so that by the grace of God he might undergo death for all men.
chr: ᏥᏌᏍᎩᏂ ᎡᏗᎪᏩᏘᎭ ᎾᏍᎩ ᎤᏍᏗᎩᏛ ᎡᏍᎦ ᎢᏯᎬᏁᎸᎯ ᏗᏂᎧᎿᏩᏗᏙᎯ ᎨᏒ ᏂᎨᎬᏁᎸᎢ, ᎾᏍᎩ ᎤᏲᎱᎯᏍᏗᏱ, ᏗᎬᏩᎸᏌᏛ ᎠᎴ ᎦᎸᏉᏗᏳ ᎨᏒ ᎠᏥᏍᏕᎶᏔᏅ; ᎾᏍᎩ ᏅᏓᏳᎵᏍᏙᏗᏱ ᎬᏩᎦᏘᏯ ᎤᏁᎳᏅᎯ ᎤᏓᏙᎵᏍᏗ ᎨᏒ ᎬᏗᏍᎬ ᎾᏂᎥ ᏴᏫ ᏧᏲᎱᏎᏗᏱ.

source: Because it was right for him, for whom and through whom all things have being, in guiding his sons to glory, to make the captain of their salvation complete through pain.
chr: ᎠᏎᏰᏃ ᎾᏍᎩ ᎢᏳᏛᏁᏗ ᎨᏎᎢ, ᎾᏍᎩ Ꮎ ᏄᏓᎴᏒ ᎪᎱᏍᏗ ᎠᎪᏢᎾᏁᎸᎯ, ᎠᎴ ᎾᏍᎩ ᎢᏳᏩᏂᏌᏛ ᏄᏓᎴᏒ ᎪᎱᏍᏗ ᎪᏢᏅᎯ ᏥᎩ, ᎾᏍᎩ ᏗᎬᏩᎸᏌᏛ ᏗᎨᏒ ᏫᏓᏘᏃᎯᎲ ᎤᏂᏣᏘ ᏧᏪᏥ, ᎾᏍᎩ ᎤᎾᎵᏍᏕᎸᏙᏗ ᏗᏩᏛᎡᎯ, ᏂᎦᎷᎶᎬᎾ ᎢᏯᎬᏁᏗᏱ ᎠᎩᎵᏲᎬᎢ.

source: For he who makes holy and those who are made holy are all of one family; and for this reason it is no shame for him to give them the name of brothers,
chr: ᎢᏧᎳᏰᏃ ᎾᏍᎩ Ꮎ ᏗᎦᏅᎦᎵᏍᎩ ᎨᏒ ᎠᎴ ᎾᏍᎩ ᎨᏥᏅᎦᎵᏍᎩ ᎨᏒ ᎤᏂᏠᏱᏉ; ᎾᏍᎩ ᎢᏳᏍᏗ ᎥᏝ ᎤᏕᎰᎯᏍᏗ ᏳᏰᎸᎭ ᎣᏣᎵᏅᏟ ᏧᏬᏎᏗᏱ;

source: Saying, I will give the knowledge of your name to my brothers, I will make a song of praise to you before the church.
chr: ᎯᎠ ᏥᏄᏪᏎᎢ, ᏕᏣᏙᎥ ᎬᏂᎨᏒ ᏅᏓᎦᏥᏴᏁᎵ ᎣᏣᎵᏅᏟ; ᏧᎾᏁᎶᏗ ᎤᎾᏓᏡᎬ ᎠᏰᎵ ᏙᏓᎬᏃᎩᏍᏔᏂ.

source: And again he says, I will put my faith in him. And again, See, I am here, and the children which God has given to me.
chr: ᎠᎴ ᏔᎵᏁᎢ, ᎾᏍᎩ ᏓᏥᏯᎵᏍᎦᏍᏙᏔᏂ. ᎠᎴᏬ, ᎬᏂᏳᏉ ᎠᏴ ᎠᎴ ᎾᏍᎩ Ꮎ ᏗᏂᏲᎵ ᎤᏁᎳᏅᎯ ᏗᎩᎧᏁᎸᎯ ᎨᏒᎢ.

source: And because the children are flesh and blood, he took a body himself and became like them; so that by his death he might put an end to him who had the power of death, that is to say, the Evil One;
chr: ᎠᎴ ᎾᏍᎩ ᏗᏂᏲᎵ ᎤᏂᏇᏓᎵ ᎠᎴ ᎩᎬ ᎤᏂᏁᎯ ᏥᎩ, ᎤᏩᏒ ᎾᏍᏉ ᎾᏍᎩ ᎤᏠᏯᏍᏔᏁ ᎤᎩᏎᎢ; ᎾᏍᎩ ᎠᏲᎱᎯᏍᏗ ᎨᏒ ᎢᏳᏩᏂᏐᏗᏱ ᎠᏎᏉᏉ ᎢᏳᏩᏁᏗᏱ ᎾᏍᎩ Ꮎ ᎠᏲᎱᎯᏍᏗ ᎨᏒ ᎤᎵᏂᎬᎬ ᎤᎯ, ᎾᏍᎩ ᎠᏍᎩᎾ ᏥᎩ.

source: And let those who all their lives were in chains because of their fear of death, go free.
chr: ᎠᎴ ᏧᏭᏓᎴᏍᏗᏱ ᎾᏍᎩ Ꮎ ᎠᏲᎱᎯᏍᏗ ᎨᏒ ᎠᏂᎾᏰᏍᎬ ᏥᏅᏗᎦᎵᏍᏗᏍᎨ ᏓᏅᏅ ᎢᎪᎯᏛ ᏧᎾᏓᏲᏒᎯ ᏥᎨᏒ ᏕᎨᏥᎾᏝᎥᎢ.

source: For, truly, he does not take on the life of angels, but that of the seed of Abraham.
chr: ᎤᏙᎯᏳᎯᏰᏃ ᎥᏝ ᏗᏂᎧᎿᏩᏗᏙᎯ ᏱᏚᏬᏯᏁᏎᎢ, ᎡᏆᎭᎻᏍᎩᏂ ᎤᏁᏢᏔᏅᏛ ᎨᏒ ᏚᏬᏯᏁᏎᎢ.

source: Because of this it was necessary for him to be made like his brothers in every way, so that he might be a high priest full of mercy and keeping faith in everything to do with God, making offerings for the sins of the people.
chr: ᎾᏍᎩ ᎢᏳᏍᏗ ᏚᏳᎪᏛᎩ ᏂᎦᎥ ᏄᏛᏅᏅ ᎠᎾᎵᏅᏟ ᎾᏍᎩᏯ ᏄᎾᏍᏛ ᎢᏳᎵᏍᏙᏗᏱ, ᎾᏍᎩ ᎤᏓᏙᎵᏍᏗ ᎠᎴ ᏄᏓᎵᏍᏛᎾ ᏄᎬᏫᏳᏒ ᎠᏥᎸ-ᎨᎶᎯ ᎢᏳᎵᏍᏙᏗᏱ ᎤᏁᎳᏅᎯ ᎤᏤᎵ ᎤᎬᏩᎵ, ᎾᏍᎩ ᎠᎵᏍᎪᎸᏔᏅᎯ ᎠᎫᏴᏙᏗ ᎢᏳᎵᏍᏙᏗᏱ ᎤᏂᏍᎦᏅᏨ ᏴᏫ;

source: For having been put to the test himself, he is able to give help to others when they are tested.
chr: ᎾᏍᎩᏰᏃ ᎤᏩᏒ ᎤᎩᎵᏲᏨᎯ ᏥᎩ, ᎾᏍᎩ ᎠᏥᎪᎵᏰᏍᎬᎢ ᏰᎵᏉ ᏗᎬᏩᏍᏕᎸᏗ ᏄᎵᏍᏔᏅ ᎾᏍᎩ Ꮎ ᎨᏥᎪᎵᏰᏍᎩ.

source: For this reason, holy brothers, marked out to have a part in heaven, give thought to Jesus the representative and high priest of our faith;
chr: ᎾᏍᎩ ᎢᏳᏍᏗ ᎡᏥᎸᏉᏗ ᎢᏓᎵᏅᏟ, ᎢᏣᏠᏯᏍᏗᏍᎩ ᎦᎸᎳᏗ ᎤᎬᏩᎵ ᎥᏓᏘᏯᏅᏗ ᎨᏒᎢ, ᎡᏣᏓᏅᏛᎵ ᎦᎶᏁᏛ ᏥᏌ ᎠᏥᏅᏏᏛ ᎠᎴ ᏄᎬᏫᏳᏒ ᎠᏥᎸᎨᎶᎯ ᎾᏍᎩ ᏤᏓᏁᎶᏗ ᏥᎩ.

source: Who kept faith with God who gave him his place, even as Moses did in all his house.
chr: ᎾᏍᎩ ᏄᎵᏓᏍᏔᏅᎾ ᎨᏒ ᎾᏍᎩ Ꮎ ᎤᏁᏤᎸᎯ, ᎾᏍᎩᏯ ᎾᏍᏉ ᎼᏏ ᏄᏓᎵᏓᏍᏛᎾ ᏥᎨᏎ ᏂᎦᎥ ᏚᏓᏘᎾᎥᎢ.

source: And it was right for this man to have more honour than Moses, even as the builder of a house has more honour than the house.
chr: ᎯᎠᏰᏃ ᎾᏍᎩ ᎠᏍᎦᏯ ᎤᏟ ᎠᏥᎸᏉᏗᏳ ᎠᏥᏰᎸᏎ ᎡᏍᎦᏉ ᎼᏏ, ᎩᎶᏰᏃ ᎠᏓᏁᎸ ᎤᏁᏍᎨᎲᎯ ᎤᏟ ᎠᏥᎸᏉᏗᏳ ᎨᏐ ᎡᏍᎦᏉ ᎠᏓᏁᎸᎢ.

source: For every house has a builder; but the builder of all things is God.
chr: ᏂᎦᎥᏰᏃ ᏓᏓᏁᎸ ᎩᎶ ᏧᏬᏢᏅᎯ ᎨᏐᎢ; ᎾᏍᎩ Ꮎ ᏂᎦᎥ ᏧᏓᎴᏅᏛ ᎤᏬᏢᏅᎯ ᎨᏒ ᎤᏁᎳᏅᎯ.

source: And Moses certainly kept faith as a servant, in all his house, and as a witness of those things which were to be said later;
chr: ᎠᎴ ᎼᏏ ᎤᏙᎯᏳᎯ ᏄᏓᎵᏓᏍᏛᎾ ᎨᏒᎩ ᏂᎦᎥ ᏚᏓᏘᎾᎥᎢ ᎠᏥᏅᏏᏓᏍᏗ ᎾᏍᎩᏯᎢ, ᎾᏍᎩ ᎪᎯᏳᏗᏍᎩ ᎢᏳᎵᏍᏙᏗᏱ ᎾᏍᎩ Ꮎ ᏧᏓᎴᏅᏛ ᎬᏂᎨᏒ ᎢᎬᏁᏗ ᏥᎨᏎᎢ.

source: But Christ as a son, over his house; whose house are we, if we keep our hearts fixed in the glad and certain hope till the end.
chr: ᎦᎶᏁᏛᏍᎩᏂ ᎠᎦᏅᎩ ᎾᏍᎩᏯ ᏄᏓᎵᏓᏍᏛᎾ ᎨᏒᎩ ᎤᏩᏒ ᏚᏓᏘᎾᎥᎢ; ᎾᏍᎩ Ꮎ ᏚᏓᏘᎾᎥ ᎢᏖᎳ ᏥᎩ, ᎢᏳᏃ ᎤᎵᏂᎩᏛ ᏱᏗᎩᏂᏴᎭ ᎬᎵᏍᏆᏗᏍᎩ ᎾᏍᎩ Ꮎ ᎢᎦᎵᏍᎦᏍᏙᏛ ᎠᎴ ᎢᏓᏢᏈᏍᏙᏗᏍᎬ ᎤᏚᎩ ᎬᏗ ᎨᏒᎢ.

source: And so, as the Holy Spirit says, Today if you let his voice come to your ears,
chr: ᎾᏍᎩ ᎢᏳᏍᏗ, ᎦᎸᏉᏗᏳ ᎠᏓᏅᏙ ᎯᎠ ᏥᏂᎦᏪᎭ, ᎪᎯ ᎢᎦ ᎢᏳᏃ ᎧᏁᎬ ᎢᏣᏛᎪᏗᏱ ᎢᏣᏚᎵᏍᎨᏍᏗ,

source: Be not hard of heart, as when you made me angry, on the day of testing in the waste land,
chr: ᏞᏍᏗ ᏱᏗᏥᏍᏓᏲᏗᏍᎨᏍᏗ ᏗᏥᎾᏫ, ᎾᏍᎩᏯ ᏄᎾᏛᏁᎸ ᏥᎬᎩᎾᎸᏍᏔᏅᎩ, ᎾᎯᏳ ᎢᎦ ᏥᎬᎩᎪᎵᏰᎥᎩ ᎢᎾᎨᎢ;

source: When your fathers put me to the test, and saw my works for forty years.
chr: ᎾᎯᏳ ᏗᏥᎦᏴᎵᎨ ᏥᎬᎩᎪᎵᏰᏍᎬᎩ, ᎠᎴ ᏥᎬᏆᎦᏘᏍᎬᎩ, ᎠᏂᎪᏩᏘᏍᎬᎩᏍᎩᏂᏃᏅ ᏓᎩᎸᏫᏍᏓᏁᎲ ᏅᎦᏍᎪᎯ ᏧᏕᏘᏴᏛ.

source: So that I was angry with this generation, and I said, Their hearts are in error at all times, and they have no knowledge of my ways;
chr: ᎾᏍᎩ ᎢᏳᏍᏗ ᎦᏥᏂᏉᏘᎸᎩ ᎾᏍᎩ Ꮎ ᏴᏫ, ᎠᎴ ᎯᎠ ᎾᎩᏪᏒᎩ, ᏂᎪᎯᎸ ᏚᎴᎾᎯᎭ ᏧᏂᎾᏫ; ᎠᎴ ᎥᏝ ᎤᏂᎦᏙᎥᏒᎯ ᏱᎩ ᏓᎩᏅᏅᎢ.

source: And being angry I made an oath, saying, They may not come into my rest.
chr: ᎾᏍᎩ ᏅᏓᏳᎵᏍᏙᏔᏅᎩ ᎠᏆᏎᎵᏔᏅᎩ ᎠᎩᏔᎳᏬᏍᎬ, ᎾᏍᎩ ᎤᏂᏴᏍᏗᏳ ᏂᎨᏒᎾ ᎨᏒ ᎠᏆᏤᎵ ᎠᏣᏪᏐᎸᏍᏙᏗᏱ ᎨᏒᎢ.

source: My brothers, take care that there is not by chance in any one of you an evil heart without belief, turning away from the living God:
chr: ᎢᏤᏯᏔᎮᏍᏗ, ᎢᏓᎵᏅᏟ, ᏞᏍᏗᏉ ᏂᎯ ᎩᎶ ᎤᏬᎯᏳᎯᏍᏛ ᏂᎨᏒᎾ ᎤᎾᏫ ᏳᏯᎡᏍᏗ, ᎾᏍᎩ ᎠᏓᏅᎡᎯ ᎬᏂᏛ ᎤᏁᎳᏅᎯ.

source: But give comfort to one another every day as long as it is still Today; so that no one among you may be made hard by the deceit of sin:
chr: ᏕᏣᏓᏬᏂᏗᏍᎨᏍᏗᏍᎩᏂ ᏂᏚᎩᏨᏂᏒᎢ, ᎠᏏᏉ ᎪᎯ ᎢᎦ ᎦᎪᏎᏗ ᏥᎩ; ᎾᏍᎩ ᏂᎯ ᎩᎶ ᎨᏥᏍᏓᏲᎯᏍᏗ ᏂᎨᏒᎾ ᎢᏳᎵᏍᏙᏗᏱ ᎤᏓᎵᏓᏍᏗ ᎠᏍᎦᏂ ᎢᏳᏩᏂᏌᏛ.

source: For if we keep the substance of the faith which we had at the start, even till the end, we have a part with Christ;
chr: ᏕᎦᏚᏓᏕᏫᏒᏰᏃ ᎦᎶᏁᏛ, ᎢᏳᏃ ᏱᏅᏩᏍᏗᏉ ᏕᎩᏂᏴᏒ ᎤᎵᏂᎩᏛ ᎬᎵᏍᏆᏗᏍᎩ ᎢᎬᏱᏱ ᎢᎦᎵᏍᎦᏍᏙᏔᏅᎢ;

source: As it is said, Today if you will let his voice come to your ears, be not hard of heart, as when you made him angry.
chr: ᎯᎠᏰᏃ ᎢᎦᏪᏛ ᎢᎩ, ᎪᎯ ᎢᎦ ᎢᏳᏃ ᎢᏣᏚᎵᏍᎨᏍᏗ ᎧᏁᎬ ᎢᏣᏛᎪᏗᏱ, ᏞᏍᏗ ᏱᏗᏥᏍᏓᏲᏗᏍᎨᏍᏗ ᏗᏥᎾᏫ, ᎾᏍᎩᏯ ᏄᎾᏛᏁᎸ ᎾᎯᏳ ᏥᎬᎩᎾᎸᏍᏔᏅᎩ.

source: Who made him angry when his voice came to them? was it not all those who came out of Egypt with Moses?
chr: ᎦᎪᏰᏃ ᎿᏉ ᎤᎾᏛᎦᏅ, ᎤᏂᎿᎸᏍᏔᏁᎢ; ᏝᏍᎪ ᏂᎦᏛ ᎢᏥᏈᏱ ᏂᏙᏓᏳᏗᏅᏍᏔᏅᎯ ᏱᏏ, ᎾᏍᎩ ᏱᏄᎾᏛᏁᎴᎢ?

source: And with whom was he angry for forty years? was it not with those who did evil, who came to their deaths in the waste land?
chr: ᎠᎴ ᎦᎪ ᏅᎦᏍᎪᎯ ᏧᏕᏘᏴᏛ ᏚᏂᏆᏘᎴᎢ? ᏝᏍᎪ ᎾᏍᎩ Ꮎ ᎤᏂᏍᎦᏅᏨᎯ ᏥᎨᏎᎢ, ᎾᏍᎩ Ꮎ ᏗᏂᏰᎸ ᎢᎾᎨ ᏥᏚᏅᏤᎢ?

source: And to whom did he make an oath that they might not come into his rest? was it not to those who went against his orders?
chr: ᎠᎴ ᎦᎪ ᏚᏁᏤᎴ ᎠᏎᎵᏛᏍᎬ ᎾᏍᎩ ᎤᏂᏴᏍᏗᏱ ᏂᎨᏒᎾ ᎨᏒ ᎤᏤᎵ ᎠᏣᏪᏴᎸᏍᏙᏗᏱ? ᏝᏍᎪ ᎾᏍᎩ ᏱᎨᏎ Ꮎ ᏄᏃᎯᏳᏒᎾ ᏥᎨᏎᎢ?

source: So we see that they were not able to go in because they had no belief.
chr: ᎾᏍᎩ ᏥᏄᏍᏗ ᎢᏗᎪᏩᏘᎭ ᎾᏍᎩ ᏫᎬᏩᏂᏴᏍᏗ ᏂᎨᏒᎾ ᎨᏒ ᏅᏗᎦᎵᏍᏙᏗᏍᎬ ᏄᏃᎯᏳᏅᎾ ᎨᏒᎢ.

source: Let us then, though we still have God's word that we may come into his rest, go in fear that some of you may be unable to do so.
chr: ᎾᏍᎩ ᎢᏳᏍᏗ ᎠᏴ ᎢᏗᎾᏰᏍᎨᏍᏗ ᎾᏍᎩ ᏒᎩᏚᎢᏍᏓᏁᎸ ᏫᎩᏴᏍᏗᏱ ᏥᎩ ᎤᏤᎵ ᎠᏣᏪᏐᎸᏍᏙᏗᏱ, ᎾᏍᎩ ᎬᏂᎨᏒ ᏱᏅᎦᎵᏍᏓ ᏂᎯ ᎩᎶ ᎡᏍᎦ ᎢᏦᎭᏒᎢ.

source: And, truly, the good news came to us, even as it did to them; but the hearing of the word did them no good, because they were not united in faith with the true hearers.
chr: ᎠᏴᏰᏃ ᎣᏍᏛ ᎧᏃᎮᏛ ᎡᎦᎵᏥᏙᏁᎸᎩ, ᎾᏍᎩᏯᏉ ᏥᎨᎦᎵᏥᏙᏁᎸᎩ ᎾᏍᎩ; ᎠᏎᏃ ᎾᏍᎩ Ꮎ ᎧᏃᎮᏛ ᎤᎾᏛᎦᏅ ᎥᏝ ᏅᏂᏍᏕᎸᎮᎢ ᏅᏗᎦᎵᏍᏙᏗᏍᎨ ᎪᎯᏳᏗ ᎨᏒ ᏄᏓᏑᏴᎾ ᎨᏒ ᎠᎾᏛᎩᏍᎬᎢ.

source: For those of us who have belief come into his rest; even as he has said, As I said in my oath when I was angry, They may not come into my rest: though the works were done from the time of the making of the world.
chr: ᎠᏴᏰᏃ ᎢᎪᎯᏳᏅᎯ ᎨᏒ ᎢᏗᏴᎯᎭ ᎠᏣᏪᏐᎸᏍᏙᏗᏱ ᎨᏒᎢ; ᎾᏍᎩᏯ ᏄᏪᏒᎢ, ᎾᏍᎩᏯ ᎠᏆᏎᎵᏔᏅ ᎠᎩᏔᎳᏬᏍᎬᎢ, ᎾᏍᎩ ᎤᏂᏴᏍᏗᏱ ᏂᎨᏒᎾ ᎨᏒ ᎠᏆᏤᎵ ᎠᏣᏪᏐᎸᏍᏙᏗᏱ ᎨᏒᎢ; ᎠᏍᏆᏛᎯᏍᎩᏂᏃᏅ ᎨᏒᎩ ᏕᎦᎸᏫᏍᏓᏁᎸ ᎡᎶᎯ ᏧᏙᏢᎤ ᎤᏓᎬᏩᏓᎴᎤᏛ.

source: For in one place he has said of the seventh day, And God had rest from all his works on the seventh day;
chr: ᎢᎸᎯᏢᏰᏃ ᎦᎵᏉᎩᏁ ᎢᎦ ᎤᏁᎢᏍᏔᏅ ᎯᎠ ᏄᏪᏒ, ᎠᎴ ᎤᏁᎳᏅᎯ ᎦᎵᏉᎩᏁ ᎢᎦ ᎤᏯᏪᏐᎴ ᎤᏲᎯᏍᏔᏁ ᏂᎦᏛ ᏚᎸᏫᏍᏓᏁᎲᎢ.

source: And in the same place he says again, They will not come into my rest.
chr: ᎠᎴ ᎠᏂ ᏔᎵᏁ ᎯᎠ ᏂᎦᏪᎭ, ᎥᏝ ᏴᎬᏂᏴᎭ ᎠᏆᏤᎵ ᎠᏣᏪᏐᎸᏍᏙᏗᏱ.

source: So that as it is clear that some have to go in, and that the first hearers of the good news were not able to go in because they went against God's orders,
chr: ᎾᏍᎩᏃ ᎩᎶ ᎠᏎ ᎾᎿ ᏭᏂᏴᏍᏗ ᏥᎩ, ᎠᎴ ᎾᏍᎩ Ꮎ ᎢᎬᏱ ᎨᎦᎵᏥᏙᏁᎸᎯ ᎨᏒ ᎾᏄᏂᏴᎸᎾ ᏥᎨᏎᎢ, ᏅᏗᎦᎵᏍᏙᏗᏍᎬ ᏄᏃᎯᏳᏒᎾ ᎨᏒᎢ.

source: After a long time, again naming a certain day, he says in David, Today (as he had said before), Today if you will let his voice come to your ears, be not hard of heart,
chr: ᎠᎴ ᎾᏍᏉ ᎢᎦ ᎠᏑᏰᎭ, ᎯᎠ ᏂᎦᏪᎭ ᎤᏬᎯᏨᎯ ᎣᏂ ᏕᏫ ᎠᎬᏗᏍᎬᎢ, ᎪᎯ ᎢᎦ, ᎾᏍᎩᏯ ᎯᎠ ᎢᎦᏪᏛ ᏥᎩ, ᎪᎯ ᎢᎦ, ᎢᏳᏃ ᎧᏁᎬ ᎢᏣᏛᎪᏗᏱ ᎢᏣᏚᎵᏍᎨᏍᏗ, ᏞᏍᏗ ᏱᏗᏥᏍᏓᏲᏔᏁᏍᏗ ᏗᏥᎾᏫ.

source: For if Joshua had given them rest, he would not have said anything about another day.
chr: ᎢᏳᏰᏃ ᏦᏑᏩ ᏱᏚᏁᎴ ᎤᎾᏣᏪᏐᎸᏍᏙᏗᏱ, ᎥᏝ [ᎤᏁᎳᏅᎯ] ᎣᏂ ᏱᎬᏩᏁᎢᏍᏔᏁ ᏅᏩᏓᎴ ᎢᎦ.

source: So that there is still a Sabbath-keeping for the people of God.
chr: ᎾᏍᎩ ᎢᏳᏍᏗ ᎠᏏᏉ ᎤᎾᏘᏰᎭ ᎤᎾᏣᏪᏐᎸᏍᏙᏗᏱ ᎨᏒ ᎤᏁᎳᏅᎯ ᏧᏤᎵᎦ ᏴᏫ.

source: For the man who comes into his rest has had rest from his works, as God did from his.
chr: ᎾᏍᎩᏰᏃ Ꮎ ᎤᏴᎸᎯ ᏥᎨᏐ ᎤᏣᏪᏐᎸᏍᏙᏗᏱ, ᎾᏍᏉ ᎤᏲᎯᏍᏔᏅᎯ ᎨᏐ ᏚᎸᏫᏍᏓᏁᎲ, ᎾᏍᎩᏯ ᎤᏁᎳᏅᎯ ᏄᏛᏁᎸ ᎤᏲᎯᏍᏔᏅᎢ.

source: Because of this, let us have a strong desire to come into that rest, and let no one go after the example of those who went against God's orders.
chr: ᎾᏍᎩ ᎢᏳᏍᏗ ᎢᏓᏟᏂᎬᏁᎮᏍᏗ ᏫᎩᏴᏍᏗᏱ, ᏱᏅᏎᎦᎩᏰᏃ ᎩᎶ ᎾᏍᎩ ᏧᏕᎶᏆᎡᎸᎯ ᎨᏒ ᎾᏍᎩᏯ ᏄᏬᎯᏳᏒᎾ ᎨᏒ ᏴᎦᏅᎢᏍᏓ.

source: For the word of God is living and full of power, and is sharper than any two-edged sword, cutting through and making a division even of the soul and the spirit, the bones and the muscles, and quick to see the thoughts and purposes of the heart.
chr: ᎧᏃᎮᏛᏰᏃ ᎤᏁᎳᏅᎯ ᎤᏤᎵᎦ ᎬᏃᏛ, ᎠᎴ ᎤᎵᏂᎩᏗᏳ ᎠᎴ ᎤᏟᎯᏳ ᏂᎪᏍᏓᏴ ᎡᏍᎦᏉ ᎠᏰᎳᏍᏗ-ᎦᏅᎯᏛ ᎢᏧᎳᏗᏢ ᏗᎬᎦᏘ ᏗᎪᏍᏓᏴ, ᏕᎦᏘᎭ ᏔᎵ ᏂᎦᏗᎭ ᎠᏓᏅᏖᏗᏱ ᎠᎴ ᎠᏓᏅᏙ, ᎠᎴ ᏚᏫᏢᎢ ᎠᎴ ᏚᏍᏛᏪᏙᎬᎢ, ᎠᎴ ᏗᎬᏭᎪᏙᏗ ᎢᎩ ᏄᏍᏛ ᎠᏓᏅᏖᏍᎬ ᎠᎴ ᏄᏍᏛ ᎤᏚᎵᏍᎬ ᎤᎾᏫ.

source: And there is nothing made which is not completely clear to him; there is nothing covered, but all things are open to the eyes of him with whom we have to do.
chr: ᎥᏝ ᎠᎴ ᎪᎱᏍᏗ ᎠᏁᎳᏅᎯ ᎨᏒ ᎠᎬᏍᎦᎳᏁᎸᎯ ᏱᎩ; ᏂᎦᏗᏳᏉᏍᎩᏂ ᎤᏰᎸᎭᎢ, ᎠᎴ ᏧᏞᏛ ᎾᏍᎩ ᏙᏗᎧᏅ ᎾᏍᎩ Ꮎ ᎬᏂᎨᏒ ᎢᏰᏛᏁᏗ ᏥᎩ ᏂᎦᏛᏁᎸᎢ.

source: Having then a great high priest, who has made his way through the heavens, even Jesus the Son of God, let us be strong in our faith.
chr: ᎾᏍᎩᏃ ᏥᏗᎪᏩᏗᎭ ᎢᎩᎧᎲ ᎠᏥᎸᏉᏗ ᏄᎬᏫᏳᏒ ᎠᏥᎸ-ᎨᎶᎯ, ᎾᏍᎩ ᎦᎸᎶ ᏭᎶᏒᎯ ᏥᎩ, ᎾᏍᎩ ᏥᏌ ᎤᏁᎳᏅᎯ ᎤᏪᏥ, ᎠᏍᏓᏯ ᏕᎩᏂᏴᏎᏍᏗ ᏕᏓᏁᎶᏛᎢ.

source: For we have not a high priest who is not able to be touched by the feelings of our feeble flesh; but we have one who has been tested in all points as we ourselves are tested, but without sin.
chr: ᎥᏝᏰᏃ ᏄᎬᏫᏳᏒ ᎠᏥᎸ-ᎨᎶᎯ ᏱᎩᎧᎭ ᎾᏍᎩ ᎨᎩᏙᎵᏍᏗ ᏂᎨᏒᎾ ᎨᏒ ᏕᎩᏩᏂᎦᎸᎢ, ᏂᎦᎥᏉᏍᎩᏂ ᎠᏥᎪᎵᏰᎲᎩ ᎠᏴ ᎾᏍᎩᏯᎢ, ᎠᏎᏃ ᎾᏍᎦᏅᎾ ᎨᏒᎩ.

source: Then let us come near to the seat of grace without fear, so that mercy may be given to us, and we may get grace for our help in time of need.
chr: ᎾᏍᎩ ᎢᏳᏍᏗ ᏂᏗᏍᎦᎢᎲᎾ ᎢᏗᎷᎩ ᎾᎿ ᎬᏩᎦᏘᏯ ᎤᏓᏙᎵᏍᏗ ᎨᏒ ᎦᏍᎩᎸᎢ, ᎾᏍᎩ ᎡᎩᏙᎵᏍᏗᏱ, ᎠᎴ ᎢᎩᏩᏛᏗᏱ ᎬᏩᎦᏘᏯ ᎤᏓᏙᎵᏍᏗ ᎨᏒ ᎾᏍᎩ ᎾᎯᏳ ᎢᎩᏂᎬᏎᎲ ᎢᎦᎵᏍᏕᎸᏙᏗ.

source: Every high priest who is taken from among men is given his position to take care of the interests of men in those things which have to do with God, so that he may make offerings for sins.
chr: ᎾᏂᎥᏰᏃ ᏄᎬᏫᏳᏒ ᎠᏥᎸ-ᎠᏁᎶᎯ ᎨᏒ ᏴᏫ ᎠᏁᎲ ᎨᎪᏣᎴᏛ, ᏴᏫ ᎣᏍᏛ ᎢᏳᎾᎵᏍᏓᏁᏗ ᎨᏥᏁᏤᎰᎢ, ᎾᏍᎩ [ᏧᏂᎸᏫᏍᏓᏁᏗᏱ] ᎤᏁᎳᏅᎯ ᎤᏤᎵᎪᎯ ᎤᎬᏩᎵ, ᎾᏍᎩ ᏗᎬᏩᎾᎵᏍᎪᎸᏙᏗ ᎢᏳᎵᏍᏙᏗᏱ ᎠᏓᏁᏗ ᎨᏒ ᎠᎴ ᎠᏥᎸᎨᎳᏍᏙᏗ ᎾᏍᎩ ᎠᏍᎦᏂ ᎤᎬᏩᎵ;

source: He is able to have feeling for those who have no knowledge and for those who are wandering from the true way, because he himself is feeble;
chr: ᎾᏍᎩ ᏰᎵ ᏗᎬᏪᏙᎵᏍᏗ ᎾᏂᎦᏔᎾᎥᎾ, ᎠᎴ ᎾᏍᎩ Ꮎ ᎤᎾᎴᎾᎸᎯ; ᎤᏩᏒᏰᏃ ᎾᏍᏉ ᏚᎵᏚᏫᏍᏛᎩ ᎠᏩᏂᎦᎳ ᎨᏒᎢ.

source: And being feeble, he has to make sin-offerings for himself as well as for the people.
chr: ᎠᎴ ᎾᏍᎩ ᎢᏳᏍᏗ, ᎾᏍᎩ ᏴᏫ ᎤᎾᎵᏍᏕᎸᏙᏗ ᎠᎵᏍᎪᎸᏗᏍᎬ ᎾᏍᏉ ᎤᏩᏒ ᎤᎵᏍᏕᎸᏙᏗ ᎠᏎ ᎤᎵᏍᎪᎸᏙᏗ ᎨᏐᎢ, ᎠᏍᎦᏂ ᎤᎬᏩᎵ ᎨᏒᎢ.

source: And no man who is not given authority by God, as Aaron was, takes this honour for himself.
chr: ᎥᏝ ᎠᎴ ᎩᎶ ᎯᎠ ᎾᏍᎩ ᎦᎸᏉᏗ [ᏗᎦᎸᏫᏍᏓᏁᏗ] ᎤᏩᏒᏉ ᎤᏓᏅᏖᏛ ᏯᎩᏍᎪᎢ, ᎬᏂ ᎤᏁᎳᏅᎯ ᎤᏯᏅᏛ ᏱᎩ ᎾᏍᎩᏯ ᎡᎵᏂ ᎠᏥᏯᏅᎲᎢ.

source: In the same way Christ did not take for himself the glory of being made a high priest, but was given it by him who said, You are my Son, this day I have given you being:
chr: ᎾᏍᎩᏯ ᎾᏍᏉ ᎦᎶᏁᏛ ᎥᏝ ᎤᏩᏒ ᎯᎠ ᎦᎸᏉᏗ ᏗᎦᎸᏫᏍᏓᏁᏗ ᏳᎩᏎ ᏄᎬᏫᏳᏒ ᎠᏥᎸᎨᎶᎯ ᎾᎬᏁᎸᎢ; ᎯᎠᏍᎩᏂ ᎢᏳᏪᏎᎸᎯ, ᎠᏇᏥ ᏂᎯ, ᎪᎯ ᎢᎦ ᏍᏆᏕᎲᏏ, [ᎾᏍᎩ ᎤᏯᏅᎮᎢ.]

source: As he says in another place, You are a priest for ever after the order of Melchizedek.
chr: ᎾᏍᏉ ᎢᎸᎯᏢ ᎯᎠ ᏂᎦᏪᎭ, ᎠᏥᎸ-ᎮᎶᎯ ᏂᎯ ᏂᎪᎯᎸᎢ ᎺᎵᎩᏏᏕᎩ ᏄᏍᏛ ᎾᏍᎩᏯᎢ.

source: Who in the days of his flesh, having sent up prayers and requests with strong crying and weeping to him who was able to give him salvation from death, had his prayer answered because of his fear of God.
chr: ᎾᏍᎩ Ꮎ ᎾᎯᏳ ᎤᏇᏓᎵ ᎨᏒ ᎤᎴᏂᏙᎸ, ᎤᏓᏙᎵᏍᏓᏁᎸ ᎠᎴ ᎤᏔᏲᏎᎸ, ᎠᏍᏓᏴ ᏓᏠᏱᎲ, ᎠᎴ ᏓᎦᏌᏬᎢᎲ ᎬᏩᏠᏯᏍᏗ ᎾᏍᎩ Ꮎ ᎤᏔᏲᏎᎸ ᎾᏍᎩ ᏰᎵᏉ ᎬᏩᏍᏕᎸᏗ ᎬᏭᏓᎴᏍᏗ ᎨᏒ ᎠᏲᎱᎯᏍᏗ ᎨᏒᎢ, ᎠᎴ ᎠᎦᏛᎦᏁᎴ ᎦᎾᏰᏍᎬ ᎤᎬᏩᎵ;

source: And though he was a Son, through the pain which he underwent, the knowledge came to him of what it was to be under God's orders;
chr: ᎤᏪᏥᏍᎩᏂᏃᏅ ᎨᏎᎢ ᎠᏎᏃ ᎤᏬᎯᏳᎯᏍᏓ ᎢᏳᎵᏍᏙᏗᏱ ᎤᏕᎶᏆᎡ ᎤᎩᎵᏲᏨ ᎤᎦᏙᎥᎯᏍᏔᏁᎢ;

source: And when he had been made complete, he became the giver of eternal salvation to all those who are under his orders;
chr: ᎠᎴ ᏄᎪᎸᎾ ᎾᎬᏁᎸ, ᎾᏍᎩ ᎠᏩᏘᏍᎩ ᏄᎵᏍᏔᏁ ᏫᎾᏍᏛᎾ ᎤᎾᎵᏍᏕᎸᏙᏗ ᎨᏒ ᎾᏂᎥ ᎬᏬᎯᏳᎲᏍᎩ;

source: Being named by God a high priest of the order of Melchizedek.
chr: ᎠᎴ ᏄᎬᏫᏳᏒ ᎠᏥᎸ-ᎨᎶᎯ ᎺᎵᎩᏏᏕᎩ ᎾᏍᎩᏯ ᎤᏬᏎᎭ ᎤᏁᎳᏅᎯ.

source: Of whom we have much to say which it is hard to make clear, because you are slow of hearing.
chr: ᎾᏍᎩ Ꮎ ᎣᏥᏃᎮᏍᎬ ᎤᏣᏘ ᎪᎱᏍᏗ ᎦᏲᎦᏛᏗ, ᎠᎴ ᎤᏦᏍᏗᏳ ᏗᎪᏏᏐᏗᏱ, ᏅᏗᎦᎵᏍᏙᏗᏍᎬ ᏗᏥᏍᎦᏃᎵᏳ ᎨᏒ ᎢᏣᏛᎪᏗᏱ.

source: And though by this time it would be right for you to be teachers, you still have need of someone to give you teaching about the first simple rules of God's revelation; you have become like babies who have need of milk, and not of solid food.
chr: ᎾᎯᏳᏰᏃ ᏰᎵᏉ ᏗᎨᏣᏕᏲᏗ ᎡᏤᎵᏎᎸᎢ, ᎤᏚᎸᏗᏉ ᏂᏣᎵᏍᏓᏁᎭ ᎩᎶ ᏔᎵᏁ ᎢᏤᏲᏗᏱ ᏄᏍᏛ ᎢᎬᏱᏱ ᏗᏕᎶᏆᏍᏗ ᎨᏒ ᎤᏁᎳᏅᎯ ᎤᏤᎵ ᎧᏃᎮᏛ; ᎠᎴ ᎤᏅᏗ ᎤᎾᏚᎵᏍᎩ ᎾᏍᎩᏯ ᏂᏣᎵᏍᏔᏅ, ᎥᏝᏃ ᎤᏴᏍᏗ ᎠᎵᏍᏓᏴᏗ.

source: For everyone who takes milk is without experience of the word of righteousness: he is a child.
chr: ᎾᏂᎥᏰᏃ ᎩᎶ ᎤᏅᏗ ᎠᎾᎵᏍᏓᏴᏗᏍᎩ ᎥᏝ ᎤᏂᎦᏙᎥᏒᎯ ᏱᎨᏐ ᎧᏃᎮᏛ ᎠᏚᏓᎴᏍᏙᏗ ᎨᏒᎢ; ᏗᏂᏲᎵᏉᏰᏃ.

source: But solid food is for men of full growth, even for those whose senses are trained by use to see what is good and what is evil.
chr: ᎤᏴᏍᏗᏍᎩᏂ ᎠᎵᏍᏓᏴᏗ ᏧᎾᏛᎾᏯ ᎤᏁᎵᏍᏓᏴᏙᏗ ᎨᏐᎢ, ᎾᏍᎩ Ꮎ ᎤᏂᎩᏌᎲ ᎢᏳᏍᏗ ᎬᏩᎾᏙᎴᎰᎯᏍᏗ ᎨᏐ ᎣᏍᏛ ᎨᏒ ᏄᏍᏛᎢ, ᎠᎴ ᏄᏍᏛ ᎤᏲ ᎨᏒᎢ.

source: For this reason let us go on from the first things about Christ to full growth; not building again that on which it is based, that is, the turning of the heart from dead works, and faith in God,
chr: ᎾᏍᎩ ᎢᏳᏍᏗ ᎢᏗᎯᏯᏍᎬ ᎠᎴᏅᏙᏗ ᎦᎶᏁᏛ ᎤᏤᎵ ᏗᏕᏲᏗ ᎨᏒᎢ, ᏂᎦᎷᎶᎬᎾ ᎨᏒ ᎢᏴᏛ ᏫᏗᏰᎢᎶᎦ; ᏔᎵᏁ ᎦᎫᏍᏛᏗ ᏂᏗᎲᏍᎬᎾ ᎦᏁᏟᏴᏍᏗ ᎨᏒ ᎣᏓᏅᏛ ᎤᎬᏩᎵ, ᎠᏓᎯᎯᏉ ᏗᎦᎸᏫᏍᏓᏁᏗ ᏥᎩ, ᎠᎴ ᎤᏁᎳᏅᎯ ᎪᎯᏳᏗ ᎨᏒᎢ,

source: The teaching of baptisms, and of the putting on of hands, and of the future life of the dead, and of the judging on the last day.
chr: ᏗᏓᏬᏍᏗ ᎨᏒ ᏗᏕᏲᏅᎯ ᎤᎬᏩᎵ, ᎠᎴ ᏗᏓᏏᏔᏗᏍᏗ ᎨᏒ ᎤᎬᏩᎵ, ᎠᎴ ᏧᏂᏲᎱᏒᎯ ᏧᎾᎴᎯᏐᏗ ᎨᏒ ᎤᎬᏩᎵ, ᎠᎴ ᎤᎵᏍᏆᏗᏍᏗ ᏂᎨᏒᎾ ᏗᎫᎪᏙᏗ ᎨᏒ ᎤᎬᏩᎵ.

source: Now we will do this, if God lets us.
chr: ᎠᎴ ᎾᏍᎩ ᎯᎠ ᏅᏓᏓᏛᏁᎵ ᎢᏳᏃ ᎤᏁᎳᏅᎯ ᏱᎦᎵᏍᎪᎸᏓᏁᎸ.

source: As for those who at one time saw the light, tasting the good things from heaven, and having their part in the Holy Spirit,
chr: ᎬᏩᏟᏍᏗᏰᏃ ᎾᏍᎩ Ꮎ ᎢᎸᎯᏳ ᎢᎦ ᎨᎦᏗᏍᏓᏁᎸᎯ ᎨᏒᎢ, ᎠᎴ ᎤᎾᏁᎶᏔᏅᎯ ᎨᏒ ᎦᎸᎶᎢ ᏅᏓᏳᏓᎴᏅᎯ ᎠᏓᏁᏗ ᎨᏒᎢ, ᎠᎴ ᎦᎸᏉᏗᏳ ᎠᏓᏅᏙ ᎨᎦᏠᏯᏍᏔᏅ ᎨᏥᏁᎸᎯ.

source: With knowledge of the good word of God, and of the powers of the coming time,
chr: ᎠᎴ ᎤᎾᏁᎶᏔᏅᎯ ᏥᎩ ᎣᏍᏛ ᎧᏃᎮᏛ ᎤᏁᎳᏅᎯ ᎤᏤᎵᎦ, ᎠᎴ ᎤᎵᏂᎩᏛ ᎨᏒ ᎤᎵᏍᏆᎸᏗ ᎨᏒᎢ,

source: And then let themselves be turned away, it is not possible for their hearts to be made new a second time; because they themselves put the Son of God on the cross again, openly shaming him.
chr: ᎾᏍᎩ ᏧᏂᏲᏒᎯ ᎨᏒᎢ, ᎬᏩᏟᏍᏗ ᏔᎵᏁ ᎢᏤ ᎢᎨᎬᏁᏗᏱ ᎦᏁᏟᏴᏍᏗ ᎨᏒ ᏚᎾᏓᏅᏛ ᏭᏂᎷᎯᏍᏗᏱ; ᎤᏅᏒᏰᏃ ᏔᎵᏁ ᎤᎾᏓᏛᏁᎸᎯ ᎢᎩ ᎤᏁᎳᏅᎯ ᎤᏪᏥ, ᎠᎴ ᎬᏂᎨᏒ ᎬᏩᏕᎰᎯᏍᏔᏅᎯ ᎢᎩ.

source: For a land, drinking in the frequent rain and producing good plants for those for whom it is worked, has a blessing from God:
chr: ᎦᏙᎯᏰᏃ ᏣᏗᏔᏍᎪ ᎠᎹ ᏯᏃ ᎤᎦᎿᏂᎯᎲᎢ, ᎠᎴ ᏥᎦᎾᏄᎪᏫᏍᎪ ᎠᏛᏒᎥᏍᎩ ᎪᎱᏍᏗ ᎤᏅᏙᏗ ᎾᏍᎩ Ꮎ ᎦᏙᎯ ᎨᏥᎶᎦᏁᎸᎯ, ᎾᏍᎩ ᎤᏁᎳᏅᎯ ᎣᏍᏛ ᎾᏛᏁᎰᎢ.

source: But if it sends up thorns and evil plants, it is of no use and is ready to be cursed; its only end is to be burned.
chr: ᎾᏍᎩᏍᎩᏂ Ꮎ ᏥᏍᏚᏂᎩᏍᏗ ᎠᎴ ᎧᏄᎦᎸ ᎠᏛᏍᎬᎢ ᎠᏗᏅᏗᏉ, ᎠᎴ ᎠᏍᎦᎢᏍᏗᏱ ᎨᏒ ᎾᎥᏂᏳ ᏄᏍᏗᏕᎪᎢ, ᎾᏍᎩ ᎤᎵᏍᏆᎸᏗ ᎨᏒ ᎠᎪᎲᏍᏙᏗ ᏥᎩ.

source: But, my loved ones, though we say this, we are certain that you have better things in you, things which go with salvation;
chr: ᎠᏎᏃ, ᏂᎯ ᎨᏒ ᎢᏨᎨᏳᎢ, ᏅᏟᎯᏳ ᎣᏍᏛ ᎤᏚᎩ ᎢᏨᏴᎾᏁᎭ, ᎠᎴ ᎠᎵᏍᏕᎸᏙᏗ ᎨᏒ ᎤᎬᏩᎵ ᏔᎵ ᎤᏛᏗᏕᎬᎢ, ᎯᎠᏍᎩᏂᏃᏅ ᏃᏥᏪᎭ.

source: For God is true, and will not put away from him the memory of your work and of your love for his name, in the help which you gave and still give to the saints.
chr: ᎤᏁᎳᏅᎯᏰᏃ ᎥᏝ ᏂᏚᏳᎪᏛᎾ ᎢᎬᏩᏛᏁᏗ ᏱᎩ ᎾᏍᎩ ᎤᏩᎨᏫᏍᏗᏱ ᏕᏥᎸᏫᏍᏓᏁᎸ ᎠᎴ ᎬᏂᎨᏒ ᏂᏨᏁᎸ ᎢᏥᎨᏳᏒ ᏕᎤᏙᎥᎢ. ᎾᏍᎩ ᏕᏥᏍᏕᎸᎯᏙᎸ ᎤᎾᏓᏅᏘ, ᎠᎴ ᎠᏏᏉ ᏕᏥᏍᏕᎵᏍᎬᎢ.

source: And it is our desire that you may all keep the same high purpose in certain hope to the end:
chr: ᎠᎴ ᎣᎦᏚᎵᎭ ᏂᏥᎥ ᎢᏥᏏᏴᏫᎭ ᎨᏒ ᎬᎵᏍᏆᏗᏍᎩ ᎾᏍᎩᏯ ᎢᎦᎢ ᎢᏣᏟᏂᎬᏁᏗᏱ ᎬᏂ ᎤᏣᏘ ᏄᏜᏏᏛᏒᎾ ᎤᏚᎩ ᎬᏗ ᎨᏒ ᏫᏥᏱᎶᎸᎭ;

source: So that you may not be slow in heart, but may take as your example those to whom God has given their heritage, because of their faith and their long waiting.
chr: ᎾᏍᎩ ᎢᏳᏍᏗ ᏞᏍᏗ ᎢᏣᏓᏄᎸᏗᏉ ᏱᎨᏎᏍᏗ, ᏗᏥᏍᏓᏩᏕᎩᏍᎩᏂ ᎨᏎᏍᏗ ᎾᏍᎩ Ꮎ ᎤᏃᎯᏳᏒ ᎠᎴ ᏗᏅᏂᏗᏳ ᎨᏒ ᎠᏅᏗᏍᎬ ᎤᎾᏤᎵ ᏄᏅᏁᎸ ᎠᏚᎢᏍᏔᏅᎢ.

source: For when God made his oath to Abraham, because there was no greater oath, he made it by himself,
chr: ᎤᏁᎳᏅᎯᏰᏃ ᎡᏆᎭᎻ ᎤᏚᎢᏍᏓᏁᎸ, ᎾᏍᎩ ᎩᎶ ᏅᏩᏓᎴ ᎤᏟ ᎢᏯᏥᎸᏉᏗ ᏒᎲ ᎬᏩᏎᎵᏙᏗ ᏂᎨᏒᎾ ᎨᏎᎢ, ᎤᏩᏒ ᎡᎲ ᎤᏎᎵᏙᏔᏁᎢ,

source: Saying, Be certain that I will give you my blessing, and make your numbers very great.
chr: ᎯᎠ ᏄᏪᏎᎢ, ᎤᏙᎯᏳᎯᏯ ᎤᏣᏘ ᎣᏍᏛ ᏅᏓᎬᏯᏛᏁᎵ, ᎠᎴ ᎤᏣᏘ ᏓᎬᏁᏉᎢ.

source: And so, when he had been waiting calmly for a long time, God's word to him was put into effect.
chr: ᎰᏩᏃ ᎪᎯᏗᏳ ᎤᎦᏘᏛ ᎠᏥᏁᎴ ᎠᏚᎢᏍᏔᏅᎯ ᎨᏒᎢ.

source: For men at all times make their oaths by what is greater; and any argument is ended by the decision of the oath.
chr: ᏴᏫᏰᏃ ᎤᏙᎯᏳᎯ ᎤᏟ ᎢᏯᏥᎸᏉᏗ ᎡᎲ ᎨᎦᏎᎵᏙᏗᏍᎪᎢ; ᎠᎴ ᎠᏎᎵᏔᏅᎯ ᎨᏒ (ᎪᎱᏍᏗ) ᎠᏍᏓᏱᏗᏍᏙᏗ ᎠᏲᎯᏍᏗᏍᎩ ᎨᏐ ᎠᎾᏗᏒᎯᎲᎢ.
